In [2]:
import pandas as pd
df1 = pd.DataFrame({'AGE':[16, 20], 'INCOME': [1000, 3000]})
df2 = pd.DataFrame({'AGE':[25, 26], 'INCOME': [4000, 5000]})

In [3]:
df1

   AGE  INCOME
0   16    1000
1   20    3000

In [4]:
df2

   AGE  INCOME
0   25    4000
1   26    5000

In [5]:
df1 = df1.rename(columns={'AGE': 'age', 'INCOME' : 'income'})
df2 = df2.rename(columns={'AGE': 'age', 'INCOME' : 'income'})

In [6]:
df1

   age  income
0   16    1000
1   20    3000

In [8]:
df2

   age  income
0   25    4000
1   26    5000

In [9]:
res = pd.concat([df1, df2]) # row wise
res

   age  income
0   16    1000
1   20    3000
0   25    4000
1   26    5000

In [10]:
res = pd.concat([df1, df2], axis=1) # columns wise
res

   age  income  age  income
0   16    1000   25    4000
1   20    3000   26    5000